import { Post } from './post'

/**
 *  示例demo1
 */

export const PostDemoA: React.FC = () => {
  return (
    <Post title='我们世界的核心：我们的自我感觉'>
      <p>
        你的自我概念（对自己是谁的认识）不仅包括你的个人身份（你对自己个人属性的认识），也包括你的社会身份。对于你是谁的社会定义——你的民族、信仰、性别、学术专业等等——也暗含着你不是谁的定义。这个范畴包括"我们"而排斥"他们"。
      </p>

      <p>
        当我们是一个大团体中的某个小团体的一部分时，我们经常会意识到自己的社会身份；当我们的社会团体占多数时，可能我们就不太考虑它。
      </p>

      <p>
        作为一个男性团体中单独一名女性，或一个欧洲群体中的加拿大人，我们都会意识到自己的独特性。作为白人学校中的黑人学生，或黑人学校中的白人学生，个体都会敏感地意识到自己的种族身份并因此而做出反应。
      </p>

      <p>
        在加拿大，大多数人把自己看做是"加拿大人"——除非是在魁北克，那里少数法国血统的人更多地感觉自己是"魁北克省人"(Kalin&Berry,1995)
      </p>
      <p>
        你的自我概念（对自己是谁的认识）不仅包括你的个人身份（你对自己个人属性的认识），也包括你的社会身份。对于你是谁的社会定义——你的民族、信仰、性别、学术专业等等——也暗含着你不是谁的定义。这个范畴包括"我们"而排斥"他们"。
      </p>

      <p>
        当我们是一个大团体中的某个小团体的一部分时，我们经常会意识到自己的社会身份；当我们的社会团体占多数时，可能我们就不太考虑它。
      </p>

      <p>
        作为一个男性团体中单独一名女性，或一个欧洲群体中的加拿大人，我们都会意识到自己的独特性。作为白人学校中的黑人学生，或黑人学校中的白人学生，个体都会敏感地意识到自己的种族身份并因此而做出反应。
      </p>

      <p>
        在加拿大，大多数人把自己看做是"加拿大人"——除非是在魁北克，那里少数法国血统的人更多地感觉自己是"魁北克省人"(Kalin&Berry,1995)
      </p>
    </Post>
  )
}

export const PostDemoB: React.FC = () => {
  return (
    <Post title='日常生活中的基本归因错误'>
      <p>
        当我们解释他人行为的时候，我们会犯基本归因错误。而对于我们自己的行为，我们却通常用情境因素来解释。因此约翰会将他自己的行为归因于情境（​“事情全都变得很糟，这令我很生气”​）​，但艾丽斯却认为，​“约翰是一个脾气暴躁的人，因此他总是不友好”​。当涉及到我们自己的时候，我们通常使用描述行为和反应的词语（​“当……的时候我会感到很苦恼”​）​。涉及到他人的时候，我们更经常用“那个人怎么怎么样”之类的语言（​“他真是一个令人讨厌的人”​）(Fiedler&others,1991;McGuire&McGuire,1986;White&Younger,1988)。那些将妻子的批评归因为“吝啬和冷淡”的丈夫更容易成为家庭暴力的实施者(Schweinle&Ickes,2003)。当妻子指出他们之间的关系出现危机时，他们会非常愤怒。
      </p>
      <p>
        在实际生活中，那些有权势的人常常会主动提起一个话题并控制谈话内容，这往往会使其下属过高地估计他们的知识和能力。例如医学博士常常会被认为在其他许多与医学无关的领域也是专家。同样地，学生们也常高估老师的能力（就像前面讲述的实验一样，老师就是在他那所擅长的领域中的提问者）​。然而当这些学生中的一部分人也成为老师后，他们会惊奇地发现，其实老师并没有想像中的那么有才气
      </p>
      <p>
        要进一步举例说明基本归因错误，我们只需仔细看看自己的经历就不难发现。为了结识一些新朋友，比弗强装笑脸，并且小心翼翼地参加了一个聚会。在聚会上，别人都谈笑风生，大家都显得轻松愉快。比弗很奇怪，​“为什么其他人那么轻松自在，而我却紧张害怕呢？​”实际上，其他人也与比弗一样，自己内心紧张得要命却认为比弗和其他人就像他们所表现的那样——轻松愉快。
      </p>
      <p>
        责任归因是许多法院判决的核心内容(Ficcham&Jaspars,1980)。1994年，在辛普森因被指控谋杀前妻和另外一个男人而被捕后的一周里，格雷厄姆(Sandra
        Graham,1997)领导的加利福尼亚大学洛杉矶分校的研究小组，对洛杉矶市一些确信辛普森有罪的市民做了调查。那些认为辛普森的行为是在特定环境下无法控制的市民提议减轻对他的惩罚，而那些认为他是主动犯罪的市民则主张对他施以重罚。该案例可以在一定程度上代表许多司法审判中存在的争议：起诉人说，​“你犯了罪，应该被判刑”​；而被告则辩护说，​“那不是我的错，我只是环境的牺牲品”​；或者“在那种情境下我别无选择，只能那么做。​”
      </p>
      <p>
        责任归因是许多法院判决的核心内容(Ficcham&Jaspars,1980)。1994年，在辛普森因被指控谋杀前妻和另外一个男人而被捕后的一周里，格雷厄姆(Sandra
        Graham,1997)领导的加利福尼亚大学洛杉矶分校的研究小组，对洛杉矶市一些确信辛普森有罪的市民做了调查。那些认为辛普森的行为是在特定环境下无法控制的市民提议减轻对他的惩罚，而那些认为他是主动犯罪的市民则主张对他施以重罚。该案例可以在一定程度上代表许多司法审判中存在的争议：起诉人说，​“你犯了罪，应该被判刑”​；而被告则辩护说，​“那不是我的错，我只是环境的牺牲品”​；或者“在那种情境下我别无选择，只能那么做。​”
      </p>
    </Post>
  )
}
